obj = [["","8:30-9:15","9:25-10:10","10:20-11:05","11:20-12:05","12:20-13:05","13:15-14:00","14:10-14:55","15:00-15:45"],["Пн","Технології","Алгебра","Англ/Укр.мова","Зар.літ","Геометрія","Англ./Укр.мова","Гром.осв.","-"],["Вт","Хімія","Фізика","Геометрія","Біологія","Географія/іст.Укр","Фізкультура","Алгебра","-"],["Ср","Фізкультура","Географія","Укр.мова/інформ","Захист Укр./Технології","Укр.мова/інформ","Гром.осв.","Алгебра","-"],["Чт","Алгебра","іст.Укр","укр.літ","геометрія","фізкультура","біологія","фізика","інформ./хімія"],["Пт","Захист України","Укр.м/Англ.","Фізика","Всесв.іст.","Укр.м/Англ.","Укр.літ","Алгебра","-"],["Сб","-","-","-","-","-","-","-","-"],["Нд","-","-","-","-","-","-","-","-"]];
obj1 = [["Технології","Алгебра","Англ/Укр.мова","Зар.літ","Геометрія","Англ./Укр.мова","Гром.осв.","-"],["Хімія","Фізика","Геометрія","Біологія","Географія/іст.Укр","Фізкультура","Алгебра","-"],["Фізкультура","Географія","Укр.мова/інформ","Захист Укр./Технології","Укр.мова/інформ","Гром.осв.","Алгебра","-"],["Алгебра","іст.Укр","укр.літ","геометрія","фізкультура","біологія","фізика","інформ./хімія"],["Захист України","Укр.м/Англ.","Фізика","Всесв.іст.","Укр.м/Англ.","Укр.літ","Алгебра","-"],["-","-","-","-","-","-","-","-"],["-","-","-","-","-","-","-","-"]];



timetable.innerHTML = "";



console.log(obj);
output.innerHTML = "Hello";
let n = 0;
obj.forEach(element => {
    console.log(element);
    let str = "s"+n;
    let create_element = document.createElement("div");
    create_element.classList.add("s"+n);
    let k = 1;
    element.forEach(el =>{
        console.log(el);
        create_sub_element = document.createElement("div");
        create_sub_element.classList.add("l"+k);
        text_node = document.createTextNode(el);
        create_sub_element.appendChild(text_node);
        create_element.appendChild(create_sub_element);
        
        k+=1;
    });
    timetable.appendChild(create_element)
    
    console.log(str);
    n +=1;
});